package com.academy.telesens.lesson_04.home_task;

public class Task9 {
    public static void main(String[] args) {
        /*
        Реализовать программу, которая:
	- в диалоговом режиме запрашивает размер двумерного массива
	- в диалоговом режиме считывает элементы массива (дробные трехзначные числа с двумя знаками после запятой)
	- выводите массив в виде отформатированном виде (оставляя два знака после запятой), напр. для массива размером 3:

		|3.14   2.7    124.45|
		|15.55  112.76 4.45  |
		|5      0      -66   |

	- определяет и выводит на экран:
		-- минимальный элемент (-66)
		-- максимальный (124.45)
		-- номер строки, сумма элементов которой максимальна (в данном примере 2-ая строка)
		-- номер строки, сумма которых минимальна (в данном примере 3)

         */
    }
}
